code-review/NRB_3471_3546/База_Стало/DataProcessors/ОтправкаСообщенийПоЗапросуНаРаскрытиеСпискаВладельцевЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаСообщенийПоЗапросуНаРаскрытиеСпискаВладельцевЦБ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СообщенияКлиентам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Субброкер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРаскрытия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаРаскрытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗагрузкиНДЦОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЮЛОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LEIКодСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЮЛСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДРеференс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеЭмитента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГосРегНомерВыпуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВыпуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПриемаИнструкцийВТБКБ</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСчетаДепоСубброкера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТипаКД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПодтвержденияСубброкераПоРСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПодтвержденияСубброкераПоРСВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНалогоплательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеНалоговыхЛьгот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолученияОтветаНД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорСубброкера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияКОтправке</Name>
			<Comment>EPAM объект</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИДУведомления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/СтатусыРаскрытияСписковВладельцев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРаскрытияСписковВладельцев</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаЗавершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЗапросНаРаскрытиеНД</Name>
					<Comment>Отправлен запрос на раскрытие номинального держателя (НД)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученОтветНДПоРаскрытию</Name>
					<Comment>Получен ответ номинального держателя (НД) по раскрытию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработано</Name>
					<Comment>Статус присваивается РСВб которые не прошли сверку с НРД</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/КодыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КодыЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
				<xr:Item>Catalog.СчетаДепоМХ</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.ЦенныеБумаги</xr:Item>
				<xr:Item>Catalog.ЮридическиеЛица</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ГруппаЦБДляНалогообложения</xr:Item>
				<xr:Item>Catalog.ТипыНалогов</xr:Item>
				<xr:Item>Catalog.Субклиенты</xr:Item>
				<xr:Item>Catalog.ТарифныеПланы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыЗагрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОтправкаСообщенийПоЗапросуНаРаскрытиеСпискаВладельцевЦБ/Ext/ObjectModule.bsl
Процедура ЗаполнитьСообщенияКлиентам() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подтверждения.КД КАК КД,
	|	Подтверждения.ДоговорСубброкера КАК Договор
	|ПОМЕСТИТЬ втПодтвержденныеДоговоры
	|ИЗ
	|	РегистрСведений.ПодтвержденияСубброкераПоРСВ КАК Подтверждения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РСВ.Клиент КАК Субброкер,
	|	РСВ.Ссылка КАК ДокументРаскрытия,
	|	РСВ.Клиент.ВнешнийИсточникДляРСВПоСубклиентам КАК ВнешнийИсточник,
	|	РСВ.Ссылка.Дата КАК ДатаДокументаРаскрытия,
	|	КодыЗагрузкиОрганизации.Код КАК КодЗагрузкиНДЦОрганизации,
	|	РСВ.Ссылка.Организация.ЮридическоеЛицо.Наименование КАК НаименованиеЮЛОрганизации,
	|	РСВ.Клиент.LEI КАК LEIКодСубброкера,
	|	ВЫРАЗИТЬ(РСВ.Клиент.ЮридическиеФизическиеЛица.ПолноеНаименование КАК СТРОКА(255)) КАК ПолноеНаименованиеЮЛСубброкера,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.КДРеференс <> """"
	|			ТОГДА РСВ.Ссылка.КДРеференс
	|		ИНАЧЕ РСВ.Ссылка.СвязанныйРеференсКД1
	|	КОНЕЦ КАК КДРеференс,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(РСВ.Ссылка.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(255)) КАК ПолноеНаименованиеЭмитента,
	|	РСВ.Ссылка.ЦеннаяБумага1.ISIN КАК ISIN,
	|	РСВ.Ссылка.ЦеннаяБумага1.НомерРегистрации КАК ГосРегНомерВыпуска,
	|	РСВ.Ссылка.ЦеннаяБумага1.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК КодНРД,
	|	РСВ.Ссылка.ДатаФиксации КАК ДатаФиксации,
	|	РСВ.Ссылка.ДатаОкончанияПриема КАК ДатаОкончанияПриема,
	|	РСВ.СчетДепо.Код КАК КодСчетаДепоСубброкера,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.КДРеференс <> """"
	|			ТОГДА РСВ.Ссылка.ВидКорпоративногоДействия.Наименование
	|		ИНАЧЕ РСВ.Ссылка.СвязанныйВидКД1.Наименование
	|	КОНЕЦ КАК ТипКД,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.КДРеференс <> """"
	|			ТОГДА РСВ.Ссылка.ВидКорпоративногоДействия.Код
	|		ИНАЧЕ РСВ.Ссылка.СвязанныйВидКД1.Код
	|	КОНЕЦ КАК КодТипаКД,
	|	СУММА(РСВ.Количество) КАК Количество
	|ИЗ
	|	Документ.РаскрытиеСпискаВладельцев.СписокВладельцев КАК РСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПодтвержденныеДоговоры КАК ПодтвержденныеДоговоры
	|		ПО РСВ.Ссылка.КарточкаКД = ПодтвержденныеДоговоры.КД
	|			И РСВ.Договор = ПодтвержденныеДоговоры.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиОрганизации
	|		ПО (КодыЗагрузкиОрганизации.Владелец = РСВ.Ссылка.Организация.ЮридическоеЛицо)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиОрганизации.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиОрганизации.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиОрганизации.ДатаОкончанияДействия > РСВ.Ссылка.ДатаФиксации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО (КодыЗагрузкиЦБ.Владелец = РСВ.Ссылка.ЦеннаяБумага1)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > РСВ.Ссылка.ДатаФиксации)
	|ГДЕ
	|	РСВ.Клиент.Субброкер
	|	И НАЧАЛОПЕРИОДА(РСВ.Ссылка.ДатаОкончанияПриемаИнструкцийВТБКБ, ДЕНЬ) = &ТекущаяДата
	|	И РСВ.Ссылка.Статус В(&Статусы)
	|	И ПодтвержденныеДоговоры.Договор ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	РСВ.Клиент,
	|	РСВ.Ссылка,
	|	КодыЗагрузкиОрганизации.Код,
	|	ВЫРАЗИТЬ(РСВ.Клиент.ЮридическиеФизическиеЛица.ПолноеНаименование КАК СТРОКА(255)),
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(РСВ.Ссылка.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).ПолноеНаименование КАК СТРОКА(255)),
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """"),
	|	РСВ.СчетДепо.Код,
	|	РСВ.Клиент.ВнешнийИсточникДляРСВПоСубклиентам,
	|	РСВ.Ссылка.Дата,
	|	РСВ.Ссылка.Организация.ЮридическоеЛицо.Наименование,
	|	РСВ.Клиент.LEI,
	|	РСВ.Ссылка.ЦеннаяБумага1.ISIN,
	|	РСВ.Ссылка.ЦеннаяБумага1.НомерРегистрации,
	|	РСВ.Ссылка.ЦеннаяБумага1.НаименованиеВыпуска,
	|	РСВ.Ссылка.ДатаФиксации,
	|	РСВ.Ссылка.ДатаОкончанияПриема,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.КДРеференс <> """"
	|			ТОГДА РСВ.Ссылка.КДРеференс
	|		ИНАЧЕ РСВ.Ссылка.СвязанныйРеференсКД1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.КДРеференс <> """"
	|			ТОГДА РСВ.Ссылка.ВидКорпоративногоДействия.Наименование
	|		ИНАЧЕ РСВ.Ссылка.СвязанныйВидКД1.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РСВ.Ссылка.КДРеференс <> """"
	|			ТОГДА РСВ.Ссылка.ВидКорпоративногоДействия.Код
	|		ИНАЧЕ РСВ.Ссылка.СвязанныйВидКД1.Код
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РСВ.Клиент.Наименование");
	СтатусыОтправленныхЗапросовНаРаскрытиеНД = Новый Массив;
	СтатусыОтправленныхЗапросовНаРаскрытиеНД.Добавить(Перечисления.СтатусыРаскрытияСписковВладельцев.ОтправленЗапросНаРаскрытиеНД);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Статусы", СтатусыОтправленныхЗапросовНаРаскрытиеНД);
	Запрос.УстановитьПараметр("НДЦ", Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Выборка = Запрос.Выполнить().Выбрать();
	СообщенияКлиентам.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СообщенияКлиентам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Выборка.ВнешнийИсточник).Настройка;
		НоваяСтрока.ДатаОкончанияПриемаИнструкцийВТБКБ = ОбщегоНазначения.ДобавитьРабочийДень(
			Выборка.ДатаОкончанияПриема, -2);
	КонецЦикла;
КонецПроцедуры

Функция РезультатОтправкиСообщений() Экспорт
	ИмяСобытия = "Отправка сообщений по запросу на раскрытие списка владельцев ЦБ";
	ВсеОшибки = "";
	Для Каждого СообщениеКлиенту Из СообщенияКлиентам Цикл
		Ошибки = РезультатПроверкиОшибок(СообщениеКлиенту);
		Если ЗначениеЗаполнено(Ошибки) Тогда
			ТекстОшибокПоКлиенту = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Ошибки, Символы.ПС);
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,
				СообщениеКлиенту.ДокументРаскрытия, ТекстОшибокПоКлиенту);
				
			ВсеОшибки = ВсеОшибки + ?(ЗначениеЗаполнено(ВсеОшибки), Символы.ПС, "") + ТекстОшибокПоКлиенту; 
		Иначе
			ОтправитьСообщениеПоЭлПочте(СообщениеКлиенту);
		КонецЕсли;
	КонецЦикла;
	Возврат ВсеОшибки;
КонецФункции

Функция РезультатПроверкиОшибок(Строка)
	Поля = Новый СписокЗначений;
	Поля.Добавить(Строка.КодЗагрузкиНДЦОрганизации, "Не указан код загрузки НДЦ организации.");
	Поля.Добавить(Строка.НаименованиеЮЛОрганизации, "Не указано наименование юр.лица организации.");
	Поля.Добавить(Строка.LEIКодСубброкера, "Не указан LEI код субброкера.");
	Поля.Добавить(Строка.ПолноеНаименованиеЮЛСубброкера, "Не указано полное наименование юр.лица субброкера.");
	Поля.Добавить(Строка.КДРеференс, "Не указан КД референс или КД референс связанный 1.");
	Поля.Добавить(Строка.ПолноеНаименованиеЭмитента, "Не указано полное наименование эмитента ценной бумаги.");
	Поля.Добавить(Строка.ISIN, "Не указан ISIN ценной бумаги.");
	Поля.Добавить(Строка.ГосРегНомерВыпуска, "Не указан гос.рег.номер выпуска ценной бумаги.");
	Поля.Добавить(Строка.НаименованиеВыпуска, "Не указано наименование выпуска ценной бумаги.");
	Поля.Добавить(Строка.КодНРД, "Не указан код загрузки НРД ценной бумаги.");
	Поля.Добавить(Строка.ДатаФиксации, "Не указана дата фиксации.");
	Поля.Добавить(Строка.ДатаОкончанияПриемаИнструкцийВТБКБ, "Не указана дата окончания приема инструкций ВТБ КБ.");
	Поля.Добавить(Строка.КодСчетаДепоСубброкера, "Не указан код счета депо.");
	Поля.Добавить(Строка.КодТипаКД, "Не указан код вида КД связянного 1.");
	Поля.Добавить(Строка.ТипКД, "Не указан вид КД связанный 1.");
	
	Ошибки = Новый Массив;
	Для Каждого Поле Из Поля Цикл
		Если НЕ ЗначениеЗаполнено(Поле.Значение) Тогда
			Ошибки.Добавить(Поле.Представление);
		КонецЕсли;	
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

Процедура ОтправитьСообщениеПоЭлПочте(СтрокаСообщений)
	ТемаПисьма = "Напоминание по запросу на раскрытие списка владельцев ценных бумаг";		
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("НастройкиОбмена",	СтрокаСообщений.НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		HTMLТекстПисьма(СтрокаСообщений));
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);				
КонецПроцедуры

Функция HTMLТекстПисьма(СтрокаСообщений)
	Строки = Новый Массив;
	Строки.Добавить("<table border=""0"" cellpadding=""5"" cellspacing=""0"">");
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Отправитель</td><td>%1</td><td>%2</td></tr>",
		СтрокаСообщений.КодЗагрузкиНДЦОрганизации, СтрокаСообщений.НаименованиеЮЛОрганизации));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>LEI код получателя</td><td>%1</td><td>%2</td></tr>",
		СтрокаСообщений.LEIКодСубброкера, СтрокаСообщений.ПолноеНаименованиеЮЛСубброкера));
	Строки.Добавить("</table>");
	
	Строки.Добавить("<table border=""1"" cellpadding=""5"" cellspacing=""0"" bordercolor=""gray"">");
	Строки.Добавить("<tr><td colspan=""2"">Информация</td></tr>");
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Референс корпоративного действия</td><td>%1</td></tr>",
		СтрокаСообщений.КДРеференс));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Полное наименование эмитента</td><td>%1</td></tr>",
		СтрокаСообщений.ПолноеНаименованиеЭмитента));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>ISIN</td><td>%1</td></tr>",
		СтрокаСообщений.ISIN));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Гос. рег. номер выпуска</td><td>%1</td></tr>",
		СтрокаСообщений.ГосРегНомерВыпуска));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Наименование выпуска</td><td>%1</td></tr>",
		СтрокаСообщений.НаименованиеВыпуска));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Код НРД</td><td>%1</td></tr>",
		СтрокаСообщений.КодНРД));
	Строки.Добавить("<tr><td>&nbsp;</td><td>&nbsp;</td></tr>");
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Дата, на которую определяются (фиксируются)<br/>"
		+ "лица, имеющие право на участие в собрании</td><td>%1</td></tr>",
		Формат(СтрокаСообщений.ДатаФиксации, "ДЛФ=D")));
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Дата и время окончания приема инструкций для<br/>"
		+ "раскрытия, установленные %1</td><td>%2</td></tr>",
		СтрокаСообщений.НаименованиеЮЛОрганизации,
		Формат(СтрокаСообщений.ДатаОкончанияПриемаИнструкцийВТБКБ, "ДЛФ=D")));
	Строки.Добавить("<tr><td>&nbsp;</td><td>&nbsp;</td></tr>");
	Строки.Добавить("<tr><td>Счет депо</td><td>Остаток, шт</td></tr>");
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>%1</td><td>%2</td></tr>",
		СтрокаСообщений.КодСчетаДепоСубброкера, СтрокаСообщений.Количество));
	Строки.Добавить("<tr><td>&nbsp;</td><td>&nbsp;</td></tr>");
	Строки.Добавить(ПодставитьПараметрыВСтрокуHTML("<tr><td>Дополнительная информация</td><td>%1 %2</td></tr>",
		СтрокаСообщений.КодТипаКД, СтрокаСообщений.ТипКД));
	Строки.Добавить("</table>");
	
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(Строки, Символы.ПС);
КонецФункции

Функция ПодставитьПараметрыВСтрокуHTML(Знач СтрокаПодстановки,
	Знач Параметр1,	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Параметр1 = СокрЛП(HTMLСтрока(Параметр1));
	Параметр2 = СокрЛП(HTMLСтрока(Параметр2));
	Параметр3 = СокрЛП(HTMLСтрока(Параметр3));
	Параметр4 = СокрЛП(HTMLСтрока(Параметр4));
	Параметр5 = СокрЛП(HTMLСтрока(Параметр5));
	Параметр6 = СокрЛП(HTMLСтрока(Параметр6));
	Параметр7 = СокрЛП(HTMLСтрока(Параметр7));
	Параметр8 = СокрЛП(HTMLСтрока(Параметр8));
	Параметр9 = СокрЛП(HTMLСтрока(Параметр9));
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодстановки,
		Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
КонецФункции

Функция HTMLСтрока(Строка);
	Возврат СтрЗаменить(Строка, """", "&quot;");
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
